export const BUILDINGS_INFO: Record<string, Record<string, string>> = {
  '1': {
    '1': 'Приехали и рискуют капиталом страны, исследуя непонято что',
    '2': 'Приехали и рискуют капиталом страны, исследуя непонято что',
    '3': 'Приехали и рискуют капиталом страны, исследуя непонято что',
    '4': 'Приехали и рискуют капиталом страны, исследуя непонято что',
    '5': 'Приехали и рискуют капиталом страны, исследуя непонято что',
  },
  '2': {
    '1': 'Почему-то все решили, что они должны разбираться в оранжевых тортах',
    '2': 'Почему-то все решили, что они должны разбираться в оранжевых тортах',
    '3': 'Почему-то все решили, что они должны разбираться в оранжевых тортах',
    '4': 'Почему-то все решили, что они должны разбираться в оранжевых тортах',
    '5': 'Почему-то все решили, что они должны разбираться в оранжевых тортах',
  },
  '3': {
    '1': 'В нём Клим Шейдин когда-то выиграл рэп баттл. Это была идея Тортов.',
    '2': 'В нём Клим Шейдин когда-то выиграл рэп баттл. Это была идея Тортов.',
    '3': 'В нём Клим Шейдин когда-то выиграл рэп баттл. Это была идея Тортов.',
    '4': 'В нём Клим Шейдин когда-то выиграл рэп баттл. Это была идея Тортов.',
    '5': 'В нём Клим Шейдин когда-то выиграл рэп баттл. Это была идея Тортов.',
  },
  '4': {
    '1': 'Непонятный камень в море, он зовёт',
    '2': 'Непонятный камень в море, он зовёт',
    '3': 'Непонятный камень в море, он зовёт',
    '4': 'Непонятный камень в море, он зовёт',
    '5': 'Непонятный камень в море, он зовёт',
  },
  '5': {
    '1': 'Ну давайте копать',
    '2': 'Ну давайте копать',
    '3': 'Ну давайте копать',
    '4': 'Ну давайте копать',
    '5': 'Ну давайте копать',
  },
  '6': {
    '1': 'Такой типа подземный комплекс как в Resident Evil',
    '2': 'Такой типа подземный комплекс как в Resident Evil',
    '3': 'Такой типа подземный комплекс как в Resident Evil',
    '4': 'Такой типа подземный комплекс как в Resident Evil',
    '5': 'Такой типа подземный комплекс как в Resident Evil',
  },
};
